#include "g.Set.hpp"

// ============================================================================
// G1 SETADD
// ============================================================================
// Добавление элемента в множество.
//
// 1) Вычисляется hash.
// 2) Проверяется наличие элемента.
// 3) Если элемент уже существует — выход.
// 4) Создаётся новый узел.
// 5) Узел добавляется в начало списка.
//
// Сложность: O(1)
// ============================================================================

void Set::add(const std::string& value) {
  int index = hash(value);

  Node* current = table_[index];

  // Проверка на дубликат
  while (current != nullptr) {
    if (current->data_ == value) {
      return;
    }

    current = current->next_;
  }

  // Создание нового узла
  Node* newNode = new Node(value);

  // Вставка в начало списка
  newNode->next_ = table_[index];

  table_[index] = newNode;
}