#pragma once
#include <iostream>
#include <string>

class Array {
 private:
  int maxCapacity_;    // Максимальная вместимость массива
  int size_;           // Текущий размер массива (количество элементов)
  std::string *data_;  // Указатель на динамический массив строк
 public:
  // ============================================================================
  // КОНСТРУКТОР
  // ============================================================================
  explicit Array(int max);  // Создает массив на max элементов
  // explicit защищает от неожиданных неявных преобразований

  // ============================================================================
  // ДЕСТРУКТОР
  // ============================================================================
  ~Array();  // Освобождает память

  // ============================================================================
  // A1 Добавление элемента(в конец массива): AADD value
  // ============================================================================
  void addToTheEnd(const std::string &value);

  // ============================================================================
  // A2 Добавление элемента(по индексу): AINSERT index value
  // ============================================================================
  void addToTheIndex(int index, const std::string &value);

  // ============================================================================
  // A3 Получение элемента(по индексу): AGET index
  // ============================================================================
  std::string get(int index) const;

  // ============================================================================
  // A4 Удаление элемента(по индексу): ADEL index
  // ============================================================================
  void removeByIndex(int index);

  // ============================================================================
  // A5 Замена элемента(по индексу): ASET index value
  // ============================================================================
  void replaceByIndex(int index, const std::string &value);

  // ============================================================================
  // A6 Получение длины массива: ALENGTH
  // ============================================================================
  int length() const;

  // ============================================================================
  // A7 Печать массива: APRINT
  // ============================================================================
  void print() const;

  void saveToFile(const std::string &filename) const;
  void loadFromFile(const std::string &filename);
};
