#include "a.Array.hpp"

// ============================================================================
// A5 Замена элемента(по индексу): ASET index value
// ============================================================================
// 1) Проверяем границы индекса
// 2) Если индекс валидный, заменяем элемент на заданном индексе
// Сложность:
// - O(1) - замена элемента по индексу выполняется за константное время

void Array::replaceByIndex(int index, const std::string& value) {
  if (index < 0 || index >= size_) {
    throw std::out_of_range("Index invalid");
  }
  data_[index] = value;  // Замена элемента на заданном индексе
}